# 朴素贝叶斯 demo   极大似然估计  
#
# 给出训练集
# Xa  1  1  1  1  1  2  2  2  2  2  3  3  3  3  3
# Xb  1  2  2  1  1  1  2  2  3  3  3  2  2  3  3
# Y  -1 -1  1  1 -1 -1 -1  1  1  1  1  1  1  1 -1
# 计算(2, 1)分别属于1，-1的概率  -->  1/45, 1/15

# P(Y=1) = 9/15, P(Y=-1) = 6/15
# P(Xa=1|Y=1) = 2/9, P(Xa=2|Y=1) = 3/9, P(Xa=3|Y=1) = 4/9,   P(Xb=1|Y=1) = 1/9, P(Xb=2|Y=1) = 4/9, P(Xb=3|Y=1) = 4/9
# P(Xa=1|Y=-1) = 3/6, P(Xa=2|Y=-1) = 2/6, P(Xa=3|Y=-1) = 1/6,   P(Xb=1|Y=-1) = 3/6, P(Xb=2|Y=-1) = 2/6, P(Xb=3|Y=-1) = 1/6
# P(Y=1)P(Xa=2|Y=1)P(Xb=1|Y=1) = 9/15 * 3/9 * 1/9 = 1/45
# P(Y=-1)P(Xa=2|Y=-1)P(Xb=1|Y=-1) = 6/15 * 2/6 * 3/6 = 1/15


import numpy as np
from sklearn.naive_bayes import MultinomialNB

X = np.array([[1, 1], [1, 2], [1, 2], [1, 1], [1, 1], [2, 1], [2, 2], [2, 2], [2, 3], [2, 3], [3, 3], [3, 2], [3, 2], [3, 3], [3, 3]])
Y = np.array([-1, -1, 1, 1, -1, -1, -1, 1, 1, 1, 1, 1, 1, 1, -1])

clf = MultinomialNB()
clf.fit(X, Y)

print(clf.score([[2, 1]], [-1]))
print(clf.score([[2, 1]], [1]))
print(clf.predict([[2, 1]]))
